---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCTransaction.RollBack
source: html/ea79ab12-ca64-4dfc-e71a-93298c207056.htm
---
# Autodesk.Revit.DB.IFC.IFCTransaction.RollBack Method

Rolls back all changes made to the IFC file during the transaction.

## Syntax (C#)
```csharp
public void RollBack()
```